XiandJ/smart-hood-system/smart-hood-miniH562.ioc
#Microcontroller
#Mon May 26 11:00:00 CST 2026
File.Version=6.14.0
ProjectManager.ProjectName=smart-hood-miniH562
ProjectManager.ProjectLocation=C\:\\Users\\Lenovo\\Desktop\\chuangganqi\\CubeMX
ProjectManager.ToolChainLocation=
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.UnderRoot=false
ProjectManager.MainLocation=Core/Src
ProjectManager.KeepUserCode=true
ProjectManager.HeapSize=0x2000
ProjectManager.StackSize=0x2000

Mcu.Family=STM32H5
Mcu.Name=STM32H562VITx
Mcu.Package=LQFP100
Mcu.Pin0=PA0
Mcu.Pin1=PA1
Mcu.Pin2=PA2
Mcu.Pin3=PA3
Mcu.Pin4=PA4
Mcu.Pin5=PA5
Mcu.Pin6=PA6
Mcu.Pin7=PA8
Mcu.Pin8=PA9
Mcu.Pin9=PA10
Mcu.Pin10=PA11
Mcu.Pin11=PA12
Mcu.Pin12=PA13
Mcu.Pin13=PA14
Mcu.Pin14=PA15
Mcu.Pin15=PB6
Mcu.Pin16=PB7
Mcu.Pin17=PB10
Mcu.Pin18=PB11
Mcu.Pin19=PC4
Mcu.Pin20=PC5
Mcu.Pin21=PC13
Mcu.Pin22=PD7
Mcu.Pin23=PD8
Mcu.Pin24=PD9
Mcu.Pin25=PE0
Mcu.Pin26=PH0
Mcu.Pin27=PH1
Mcu.Pin28=PC14
Mcu.Pin29=PC15
Mcu.Pin30=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin31=VP_SYS_VS_tim2
Mcu.Pin32=VP_SYS_VS_iwdg1
Mcu.IP0=ADC1
Mcu.IP1=CORTEX_M33
Mcu.IP2=DEBUG
Mcu.IP3=DMA
Mcu.IP4=FREERTOS
Mcu.IP5=GPIO
Mcu.IP6=I2C1
Mcu.IP7=IWDG1
Mcu.IP8=NVIC
Mcu.IP9=RCC
Mcu.IP10=SYS
Mcu.IP11=TIM1
Mcu.IP12=TIM2
Mcu.IP13=USART1
Mcu.IP14=USART2
Mcu.IP15=USART3
Mcu.NVIC40=ADC1_IRQn
Mcu.NVIC41=I2C1_EV_IRQn
Mcu.NVIC42=I2C1_ER_IRQn
Mcu.NVIC43=TIM1_UP_IRQn
Mcu.NVIC44=USART1_IRQn
Mcu.NVIC45=USART2_IRQn
Mcu.NVIC46=USART3_IRQn

#Pin Assignment
PA0.Locked=true
PA0.Mode=Input_GPIO_PU
PA0.Signal=GPIO_Input_PU
PA1.Locked=true
PA1.Mode=Input_GPIO_PU
PA1.Signal=GPIO_Input_PU
PA2.Locked=true
PA2.Mode=Unused
PA2.Signal=GPIO_Output_PP
PA3.Locked=true
PA3.Mode=Unused
PA3.Signal=N/A
PA4.Locked=true
PA4.Mode=Unused
PA4.Signal=N/A
PA5.Locked=true
PA5.Mode=Unused
PA5.Signal=N/A
PA6.GPIOParameters=GPIO_Speed,PinState
PA6.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA6.Locked=true
PA6.Mode=Output_PP
PA6.PinState=GPIO_PIN_RESET
PA6.Signal=GPIO_Output
PA8.Locked=true
PA8.Mode=AF_PP_TIM1_CH1
PA8.Signal=TIM1_CH1
PA9.Locked=true
PA9.Mode=AF_PP_USART1_TX
PA9.Signal=USART1_TX
PA10.Locked=true
PA10.Mode=AF_PP_USART1_RX
PA10.Signal=USART1_RX
PA11.Locked=true
PA11.Mode=Unused
PA11.Signal=N/A
PA12.Locked=true
PA12.Mode=Unused
PA12.Signal=N/A
PA13.Locked=true
PA13.Mode=Serial_Wire
PA13.Signal=SWDIO
PA14.Locked=true
PA14.Mode=Serial_Wire
PA14.Signal=SWCLK
PA15.Locked=true
PA15.Mode=Input_GPIO_PD
PA15.Signal=GPIO_Input_PD
PB6.Locked=true
PB6.Mode=AF_OD_I2C1_SCL
PB6.Signal=I2C1_SCL
PB7.Locked=true
PB7.Mode=AF_OD_I2C1_SDA
PB7.Signal=I2C1_SDA
PB10.Locked=true
PB10.Mode=AF_PP_USART3_TX
PB10.Signal=USART3_TX
PB11.Locked=true
PB11.Mode=AF_PP_USART3_RX
PB11.Signal=USART3_RX
PC4.Locked=true
PC4.Mode=Analog_ADC1_INP4
PC4.Signal=ADC1_INP4
PC5.GPIOParameters=GPIO_Speed,PinState
PC5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC5.Locked=true
PC5.Mode=Output_PP
PC5.PinState=GPIO_PIN_RESET
PC5.Signal=GPIO_Output
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label
PC13.GPIO_Label=DEBUG_LED
PC13.GPIO_PuPd=GPIO_NOPULL
PC13.Locked=true
PC13.Mode=Output_PP
PC13.Signal=GPIO_Output
PD7.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PD7.GPIO_Label=MOTOR_EN
PD7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD7.Locked=true
PD7.Mode=Output_PP
PD7.PinState=GPIO_PIN_RESET
PD7.Signal=GPIO_Output
PD8.Locked=true
PD8.Mode=AF_PP_USART2_TX
PD8.Signal=USART2_TX
PD9.Locked=true
PD9.Mode=AF_PP_USART2_RX
PD9.Signal=USART2_RX
PE0.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PE0.GPIO_Label=BUZZER
PE0.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE0.Locked=true
PE0.Mode=Output_PP
PE0.PinState=GPIO_PIN_RESET
PE0.Signal=GPIO_Output
PH0.Locked=true
PH0.Mode=HSE_Crystal
PH0.Signal=RCC_OSC_IN
PH1.Locked=true
PH1.Mode=HSE_Crystal
PH1.Signal=RCC_OSC_OUT
PC14.Locked=true
PC14.Mode=LSE_Crystal
PC14.Signal=RCC_OSC32_IN
PC15.Locked=true
PC15.Mode=LSE_Crystal
PC15.Signal=RCC_OSC32_OUT

#VP Configuration
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
VP_SYS_VS_tim2.Mode=Tim2
VP_SYS_VS_tim2.Signal=SYS_VS_tim2
VP_SYS_VS_iwdg1.Mode=IWDG1_VS
VP_SYS_VS_iwdg1.Signal=SYS_VS_iwdg1

#NVIC Configuration
NVIC.ADC1_IRQn=true\:3\:0\:false\:false\:true\:false\:true\:false
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.I2C1_EV_IRQn=true\:5\:0\:false\:false\:true\:false\:true\:false
NVIC.I2C1_ER_IRQn=true\:5\:0\:false\:false\:true\:false\:true\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.TIM1_UP_IRQn=true\:6\:0\:false\:false\:true\:false\:true\:false
NVIC.USART1_IRQn=true\:4\:0\:false\:false\:true\:false\:true\:false
NVIC.USART2_IRQn=true\:7\:0\:false\:false\:true\:false\:true\:false
NVIC.USART3_IRQn=true\:7\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.TimeBase=TIM2
NVIC.TimeBaseIP=NVIC_TIM2
NVIC.PreemptiontPriority=4

#RCC Configuration
RCC.ADCFreq_Value=125000000
RCC.AHB12Freq_Value=250000000
RCC.APB1Freq_Value=125000000
RCC.APB2Freq_Value=125000000
RCC.APB3Freq_Value=125000000
RCC.CLOCK_AHB12_DIV=RCC_HCLK_DIV1
RCC.CLOCK_APB1_DIV=RCC_APB1_DIV2
RCC.CLOCK_APB2_DIV=RCC_APB2_DIV2
RCC.CLOCK_APB3_DIV=RCC_APB3_DIV2
RCC.CortexFreq_Value=250000000
RCC.FCLKCortexFreq_Value=250000000
RCC.FamilyName=STM32H5
RCC.HCLKFreq_Value=250000000
RCC.HSEFreq_Value=8000000
RCC.HSI48Freq_Value=48000000
RCC.HSIFreq_Value=64000000
RCC.I2C1Freq_Value=125000000
RCC.LSEFreq_Value=32768
RCC.LSIFreq_Value=32000
RCC.PLLM=2
RCC.PLLN=125
RCC.PLLP=2
RCC.PLLQ=4
RCC.PLLR=2
RCC.PLLRoutputFreq_Value=250000000
RCC.PLLSource=RCC_PLLSOURCE_HSE
RCC.PLLState=RCC_PLL_ON
RCC.PLLVCOSource=RCC_PLLVCOSOURCE_WIDE
RCC.PLLWideVCOrangeFreq=500000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.SYSCLKFreq_Value=250000000
RCC.TIM1Freq_Value=250000000
RCC.TIM2Freq_Value=250000000
RCC.USART1Freq_Value=125000000
RCC.USART2Freq_Value=125000000
RCC.USART3Freq_Value=125000000
RCC.HSE_Enable=true
RCC.LSE_Enable=true
RCC.LSI_Enable=false
RCC.CSI_Enable=false
RCC.HSI_Enable=false
RCC.HSI48_Enable=false

#I2C1 Configuration
I2C1.I2C_Mode=I2C_FastMode
I2C1.IPParameters=I2C_Mode,Timing
I2C1.Timing=0x10707DBC
I2C1.MasterOwnAddress1=0x00

#USART1 Configuration (OpenMV 921600bps)
USART1.IPParameters=BaudRate,VirtualMode,WordLength,Parity,StopBits,Mode,OverSampling
USART1.BaudRate=921600
USART1.VirtualMode=VM_ASYNC
USART1.WordLength=UART_WORDLENGTH_8B
USART1.Parity=UART_PARITY_NONE
USART1.StopBits=UART_STOPBITS_1
USART1.Mode=UART_MODE_TX_RX
USART1.OverSampling=UART_OVERSAMPLING_16

#USART2 Configuration (Debug/ESP32 115200bps)
USART2.IPParameters=BaudRate,VirtualMode,WordLength,Parity,StopBits,Mode,OverSampling
USART2.BaudRate=115200
USART2.VirtualMode=VM_ASYNC
USART2.WordLength=UART_WORDLENGTH_8B
USART2.Parity=UART_PARITY_NONE
USART2.StopBits=UART_STOPBITS_1
USART2.Mode=UART_MODE_TX_RX
USART2.OverSampling=UART_OVERSAMPLING_16

#USART3 Configuration (PMS7003 9600bps)
USART3.IPParameters=BaudRate,VirtualMode,WordLength,Parity,StopBits,Mode,OverSampling
USART3.BaudRate=9600
USART3.VirtualMode=VM_ASYNC
USART3.WordLength=UART_WORDLENGTH_8B
USART3.Parity=UART_PARITY_NONE
USART3.StopBits=UART_STOPBITS_1
USART3.Mode=UART_MODE_TX_RX
USART3.OverSampling=UART_OVERSAMPLING_16

#ADC1 Configuration
ADC1.IPParameters=Resolution,NbrOfConversion,ScanConvMode,ContinuousConvMode,ExternalTrigConv,DataAlign,OverRun,LowPowerAutoWait,SamplingTime,EnableRegularConversion,ClockPrescaler
ADC1.Resolution=ADC_RESOLUTION_12B
ADC1.NbrOfConversion=1
ADC1.ScanConvMode=ADC_SCAN_DISABLE
ADC1.ContinuousConvMode=DISABLE
ADC1.ExternalTrigConv=ADC_SOFTWARE_START
ADC1.DataAlign=ADC_DATAALIGN_RIGHT
ADC1.OverRun=ADC_OVR_DATA_OVERWRITTEN
ADC1.LowPowerAutoWait=DISABLE
ADC1.SamplingTime=ADC_SAMPLETIME_24CYCLES_5
ADC1.EnableRegularConversion=true
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV2
ADC1.NbrOfConversionChannel=1
ADC1.Channel-0\:Channel=ADC_CHANNEL_4

#TIM1 Configuration (Motor PWM 20kHz)
TIM1.IPParameters=Channel-PWM\ Generation1\ CH1,Prescaler,Period,AutoReloadPreload,ClockDivision,RepetitionCounter
TIM1.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM1.Prescaler=0
TIM1.Period=12499
TIM1.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM1.ClockDivision=TIM_CLOCKDIVISION_DIV1
TIM1.RepetitionCounter=0

#TIM2 Configuration (FreeRTOS Timebase 1ms)
TIM2.IPParameters=Prescaler,Period
TIM2.Prescaler=249
TIM2.Period=999

#IWDG1 Configuration
IWDG1.IPParameters=Prescaler,Reload,Window
IWDG1.Prescaler=IWDG_PRESCALER_64
IWDG1.Reload=4095
IWDG1.Window=4095

#DMA Configuration (GPDMA)
DMA.Channel0_Request=GPDMA1_REQUEST_USART1_RX
DMA.Channel0_Direction=DMA_PERIPH_TO_MEMORY
DMA.Channel0_Priority=DMA_HIGH
DMA.Channel0_Mode=DMA_CIRCULAR
DMA.Channel0_MemInc=ENABLE
DMA.Channel0_PeriphInc=DISABLE
DMA.Channel0_MemDataWidth=DMA_MDATAALIGN_BYTE
DMA.Channel0_PeriphDataWidth=DMA_PDATAALIGN_BYTE

DMA.Channel1_Request=GPDMA1_REQUEST_USART2_TX
DMA.Channel1_Direction=DMA_MEMORY_TO_PERIPH
DMA.Channel1_Priority=DMA_LOW
DMA.Channel1_Mode=DMA_NORMAL
DMA.Channel1_MemInc=ENABLE
DMA.Channel1_PeriphInc=DISABLE
DMA.Channel1_MemDataWidth=DMA_MDATAALIGN_BYTE
DMA.Channel1_PeriphDataWidth=DMA_PDATAALIGN_BYTE

DMA.Channel2_Request=GPDMA1_REQUEST_ADC1
DMA.Channel2_Direction=DMA_PERIPH_TO_MEMORY
DMA.Channel2_Priority=DMA_MEDIUM
DMA.Channel2_Mode=DMA_CIRCULAR
DMA.Channel2_MemInc=ENABLE
DMA.Channel2_PeriphInc=DISABLE
DMA.Channel2_MemDataWidth=DMA_MDATAALIGN_HALFWORD
DMA.Channel2_PeriphDataWidth=DMA_PDATAALIGN_HALFWORD

DMA.Channel3_Request=GPDMA1_REQUEST_USART3_RX
DMA.Channel3_Direction=DMA_PERIPH_TO_MEMORY
DMA.Channel3_Priority=DMA_LOW
DMA.Channel3_Mode=DMA_CIRCULAR
DMA.Channel3_MemInc=ENABLE
DMA.Channel3_PeriphInc=DISABLE
DMA.Channel3_MemDataWidth=DMA_MDATAALIGN_BYTE
DMA.Channel3_PeriphDataWidth=DMA_PDATAALIGN_BYTE

#FREERTOS Configuration (CMSIS_V2)
FREERTOS.IPParameters=Tasks01,configUSE_PREEMPTION,configUSE_IDLE_HOOK,\
configUSE_TICK_HOOK,configCPU_CLOCK_HZ,configTICK_RATE_HZ,\
configMAX_PRIORITIES,configMINIMAL_STACK_SIZE,configTOTAL_HEAP_SIZE,\
configMAX_TASK_NAME_LEN,configUSE_16_BIT_TICKS,\
configIDLE_SHOULD_YIELD,configUSE_MUTEXES,configUSE_RECURSIVE_MUTEXES,\
configUSE_COUNTING_SEMAPHORES,configQUEUE_REGISTRY_SIZE,\
configUSE_QUEUE_SETS,configUSE_TIME_SLICING,configUSE_NEWLIB_REENTRANT,\
configENABLE_BACKWARD_COMPATIBILITY,configSTACK_DEPTH_TYPE,\
configMESSAGE_BUFFER_LENGTH_TYPE,configUSE_TASK_NOTIFICATIONS,\
configTASK_NOTIFICATION_ARRAY_ENTRIES,INCLUDE_vTaskPrioritySet,\
INCLUDE_uxTaskPriorityGet,INCLUDE_vTaskDelete,INCLUDE_vTaskSuspend,\
INCLUDE_xResumeFromISR,INCLUDE_vTaskDelayUntil,INCLUDE_vTaskDelay,\
INCLUDE_xTaskGetSchedulerState,INCLUDE_xTaskGetCurrentTaskHandle,\
INCLUDE_uxTaskGetStackHighWaterMark,INCLUDE_xTaskGetIdleTaskHandle,\
INCLUDE_eTaskGetState,INCLUDE_xEventGroupSetBitFromISR,\
INCLUDE_xTimerPendFunctionCall,INCLUDE_xTaskAbortDelay,\
INCLUDE_xTaskGetHandle,INCLUDE_xTaskResumeFromISR
FREERTOS.Tasks01=defaultTask\:0\:512\:0\:As weak\:true\:null
FREERTOS.configUSE_PREEMPTION=1
FREERTOS.configUSE_IDLE_HOOK=0
FREERTOS.configUSE_TICK_HOOK=0
FREERTOS.configCPU_CLOCK_HZ=250000000
FREERTOS.configTICK_RATE_HZ=1000
FREERTOS.configMAX_PRIORITIES=7
FREERTOS.configMINIMAL_STACK_SIZE=128
FREERTOS.configTOTAL_HEAP_SIZE=32768
FREERTOS.configMAX_TASK_NAME_LEN=16
FREERTOS.configUSE_16_BIT_TICKS=0
FREERTOS.configIDLE_SHOULD_YIELD=1
FREERTOS.configUSE_MUTEXES=1
FREERTOS.configUSE_RECURSIVE_MUTEXES=1
FREERTOS.configUSE_COUNTING_SEMAPHORES=1
FREERTOS.configQUEUE_REGISTRY_SIZE=8
FREERTOS.configUSE_QUEUE_SETS=0
FREERTOS.configUSE_TIME_SLICING=1
FREERTOS.configUSE_NEWLIB_REENTRANT=1
FREERTOS.configENABLE_BACKWARD_COMPATIBILITY=1
FREERTOS.configSTACK_DEPTH_TYPE=uint16_t
FREERTOS.configMESSAGE_BUFFER_LENGTH_TYPE=size_t
FREERTOS.configUSE_TASK_NOTIFICATIONS=1
FREERTOS.configTASK_NOTIFICATION_ARRAY_ENTRIES=3
FREERTOS.INCLUDE_vTaskPrioritySet=1
FREERTOS.INCLUDE_uxTaskPriorityGet=1
FREERTOS.INCLUDE_vTaskDelete=1
FREERTOS.INCLUDE_vTaskSuspend=1
FREERTOS.INCLUDE_xResumeFromISR=1
FREERTOS.INCLUDE_vTaskDelayUntil=1
FREERTOS.INCLUDE_vTaskDelay=1
FREERTOS.INCLUDE_xTaskGetSchedulerState=1
FREERTOS.INCLUDE_xTaskGetCurrentTaskHandle=1
FREERTOS.INCLUDE_uxTaskGetStackHighWaterMark=1
FREERTOS.INCLUDE_xTaskGetIdleTaskHandle=0
FREERTOS.INCLUDE_eTaskGetState=1
FREERTOS.INCLUDE_xEventGroupSetBitFromISR=1
FREERTOS.INCLUDE_xTimerPendFunctionCall=1
FREERTOS.INCLUDE_xTaskAbortDelay=1
FREERTOS.INCLUDE_xTaskGetHandle=1
FREERTOS.INCLUDE_xTaskResumeFromISR=1

Platform.STM32H5_01.ProjectFile=true
